//Задание 1
alert("Задание 1");
let g = "Привет";
for (i = 1; i <= 2; i++) {
    console.log(g);
}

//Задание 2
alert("Задание 2");
for (i = 1; i <= 5; i++) {
    console.log(i);
}

//Задание 3
alert("Задание 3");
for (i = 7; i <= 22; i++) {
    console.log(i);
}

//Задание 4
alert("Задание 4");
let obj = {
    "Коля": "200",
    "Вася": "300",
    "Петя": "400"
}
for (let key in obj) {
    console.log(`${key}: ${obj[key]}`);
}

//Задание 5
alert("Задание 5");
let n = 1000;
let num = 0;
let divide = n / 2;
console.log(n + " делить на 2 будет " + divide);
while (divide > 50) {
    divide = divide / 2;
    if (divide < 50) {
        break;
    }
    num++;
    console.log(divide);
}
console.log("Итераций " + num);

//Задание 6
alert("Задание 6");
const workMonth = {// за основу взяла январь 2026 года
    1: "четверг",
    2: "пятница",
    3: "суббота",
    4: "воскресенье",
    5: "понедельник",
    6: "вторник",
    7: "среда",
    8: "четверг",
    9: "пятница",
    10: "суббота",
    11: "воскресенье",
    12: "понедельник",
    13: "вторник",
    14: "среда",
    15: "четверг",
    16: "пятница",
    17: "суббота",
    18: "воскресенье",
    19: "понедельник",
    20: "вторник",
    21: "среда",
    22: "четверг",
    23: "пятница",
    24: "суббота",
    25: "воскресенье",
    26: "понедельник",
    27: "вторник",
    28: "среда",
    29: "четверг",
    30: "пятница",
    31: "суббота"
}
let firstFriday;
for (const key in workMonth) {
    if (`${workMonth[key]}` === "пятница") {
        if (`${key}` <= 7) {
            firstFriday = `${key}`;
            console.log("Первая пятница месяца - " + firstFriday + "-е число.")
        }
        console.log("Сегодня пятница, " + `${key}` + "-е число. Необходимо подготовить отчёт.");
    }
}
